[{"description":"Criar um website premium e moderno para SoftHam Sistemas - empresa de software com 30 anos no mercado em Campo Grande/MS. O site deve impressionar com design sofisticado, animações fluidas e interatividade. Referência visual do site antigo: /home/user/softham_scrape/softhamcombr/screenshot.png - mas modernize completamente mantendo a identidade (cores verde e vermelho do logo). Inclua: 1) Hero section impactante com título 'SoftHam Sistemas', subtítulo sobre 30 anos de experiência, e CTA para contato WhatsApp. 2) Seção Sobre com o texto: 'Empresa de Software sediada em Campo Grande/MS, operando há 30 anos na área de desenvolvimento de softwares. Desde a sua inauguração, possui foco principal no atendimento das demandas das empresas e seus desafios. Nós, diferentemente dos robôs, não trabalhamos apenas com nossos cérebros. Somos humanos com um amor estranho por tecnologia e imenso amor por soluções. Nós somos uma empresa orientada para você. Trabalhamos para o cliente do cliente. Entendemos você e suas necessidades.' 3) Seção 'Nossos Serviços' com 3 cards premium: 'SalesMasters Representação Comercial' (sistema para autopeças), 'Sistema Emissor Documentos Fiscais' (MDFe, CTe, NFe, NFCe), 'SalesSpot Comércios' (sistema para comércio geral com NFe/NFCe). 4) Seção 'Nossos Clientes' com galeria de logos dos clientes e frase 'Acreditamos que um trabalho não deve parecer trabalho, essa realização profissional floresce quando pessoas talentosas se reúnem para criar coisas incríveis.' 5) Estatísticas destacando '30 anos no mercado' e '100+ clientes ativos'. 6) Seção de contato com formulário (nome, telefone, email, mensagem) e botão enviar. 7) Footer completo com links para Home, Sistemas, Tutoriais, Contato, telefone (67) 9 9607-8885, email hamilton@softham.com.br, YouTube. Use efeitos modernos: parallax, scroll animations, hover effects premium, gradientes sofisticados, glassmorphism, micro-interações. Tipografia elegante e hierarquia visual forte.","type":"feature","passes":true,"id":1}]
