[{"description":"Criar um website premium e moderno para SoftHam Sistemas - empresa de software com 30 anos no mercado em Campo Grande/MS. O site deve impressionar com design sofisticado, animações fluidas e interatividade. Referência visual do site antigo: /home/user/softham_scrape/softhamcombr/screenshot.png - mas modernize completamente mantendo a identidade (cores verde e vermelho do logo). Inclua: 1) Hero section impactante com título 'SoftHam Sistemas', subtítulo sobre 30 anos de experiência, e CTA para contato WhatsApp. 2) Seção Sobre com o texto: 'Empresa de Software sediada em Campo Grande/MS, operando há 30 anos na área de desenvolvimento de softwares. Desde a sua inauguração, possui foco principal no atendimento das demandas das empresas e seus desafios. Nós, diferentemente dos robôs, não trabalhamos apenas com nossos cérebros. Somos humanos com um amor estranho por tecnologia e imenso amor por soluções. Nós somos uma empresa orientada para você. Trabalhamos para o cliente do cliente. Entendemos você e suas necessidades.' 3) Seção 'Nossos Serviços' com 3 cards premium: 'SalesMasters Representação Comercial' (sistema para autopeças), 'Sistema Emissor Documentos Fiscais' (MDFe, CTe, NFe, NFCe), 'SalesSpot Comércios' (sistema para comércio geral com NFe/NFCe). 4) Seção 'Nossos Clientes' com galeria de logos dos clientes e frase 'Acreditamos que um trabalho não deve parecer trabalho, essa realização profissional floresce quando pessoas talentosas se reúnem para criar coisas incríveis.' 5) Estatísticas destacando '30 anos no mercado' e '100+ clientes ativos'. 6) Seção de contato com formulário (nome, telefone, email, mensagem) e botão enviar. 7) Footer completo com links para Home, Sistemas, Tutoriais, Contato, telefone (67) 9 9607-8885, email hamilton@softham.com.br, YouTube. Use efeitos modernos: parallax, scroll animations, hover effects premium, gradientes sofisticados, glassmorphism, micro-interações. Tipografia elegante e hierarquia visual forte.","type":"feature","passes":true,"id":1},{"description":"REFORMULAÇÃO COMPLETA - Criar um design VERDADEIRAMENTE ÚNICO que não pareça feito por IA. CONCEITO INOVADOR: Layout assimétrico e experimental com tipografia gigante, interações inesperadas, scrolling horizontal em algumas seções, cursor customizado, elementos que quebram a grid, sobreposições criativas. HERO totalmente diferente: usar split-screen diagonal, números grandes em destaque (30 anos), texto que muda dinamicamente, background com código em movimento sutil. CORES: Evitar gradientes óbvios - usar paleta única com verde vibrante (#00ff88) e vermelho (#ff0033) do logo, fundo escuro (#0a0a0a) mas com contraste forte. ANIMAÇÕES ÚNICAS: elementos que entram de direções inusitadas, texto que se desconstrói e reconstrói, efeito de glitch sutil, parallax inverso. NAVEGAÇÃO: menu minimalista com ícones customizados, transições de página suaves. SERVIÇOS: cards com layout quebrado - tamanhos diferentes, sobreposições, hover que revela mais informações com animação única. CLIENTES: logos em tamanhos UNIFORMES (padronizar todos), disposição criativa não-linear, efeito de spotlight ao passar mouse. Evitar: glassmorphism, gradientes previsíveis, animações fade-in padrão, layouts simétricos convencionais. Criar: algo que pareça feito por designer humano criativo e inovador.","type":"feature","passes":true,"id":2},{"description":"Criar estrutura de roteamento para múltiplas páginas: HOME (index.html), SISTEMAS (sistemas.html), TUTORIAIS (tutoriais.html), CONTATO (contato.html). Implementar navegação funcional entre páginas. Na página SISTEMAS: detalhar os 3 produtos (SalesMasters, Sistema Emissor, SalesSpot) com descrições completas, recursos, benefícios. Na página TUTORIAIS: criar área para vídeos tutoriais e documentação. Na página CONTATO: formulário completo com mapa, informações de contato, integração WhatsApp.","type":"feature","passes":true,"id":3},{"description":"Padronizar TODOS os logos dos clientes com mesmo tamanho e proporção. Referência visual: /home/user/Attachments/193c39f9-6c6c-4163-bb29-6994918f919a.png - garantir que todos fiquem com dimensões idênticas e bem organizados.","type":"bug","passes":true,"id":4},{"description":"Remover o efeito glitch do logo 'SoftHam' no header e footer. Manter o nome completo sem quebrar. Estilizar como: 'Soft' em branco (#ffffff) e 'Ham' em verde vibrante (#00ff88). Remover qualquer animação ou efeito de aberração cromática do logo.","type":"bug","passes":true,"id":5},{"description":"Remover o filtro grayscale dos logos dos clientes. Manter todos os logos coloridos sempre (tanto no estado normal quanto no hover). Manter o efeito spotlight e tamanho padronizado, mas exibir as cores originais dos logos.","type":"bug","passes":true,"id":6},{"description":"Corrigir o logo para exibir 'SOFTHAM' tudo em uma única linha, sem quebra. Referência visual: /home/user/Attachments/24efd00b-1dad-4330-a57e-34d2a84a4efa.png - 'SOFT' em branco e 'HAM' em verde, mas mantendo tudo junto na mesma linha. Aplicar essa correção no navbar, hero e footer.","type":"bug","passes":true,"id":7},{"description":"Na página sistemas.html, substituir o último card 'Sistemas Específicos' pelo novo produto 'Strudent-App'. Título: 'Strudent-App Gestão Escolar'. Descrição: 'Solução completa para gestão escolar desenvolvida para instituições com até 600 alunos. Simplifique o gerenciamento de matrículas, notas, frequência, mensalidades e comunicação com pais. Interface intuitiva que transforma a administração escolar em um processo ágil e eficiente. Controle financeiro integrado, emissão de boletins, relatórios pedagógicos e muito mais em uma única plataforma.' Ícone: usar emoji 🎓 ou similar relacionado a educação.","type":"bug","passes":true,"id":8},{"description":"Melhorar drasticamente o visual da página de Sistemas. Implementar layout mais impactante e único: cards com tamanhos variados (alguns maiores, destaque visual diferenciado), usar hover effects mais sofisticados com transformações 3D, adicionar badges de 'Novo' no Strudent-App, incluir ilustrações ou ícones mais elaborados para cada sistema, melhorar hierarquia tipográfica, adicionar seção de hero no topo da página de sistemas com título impactante e descrição, implementar animações de entrada sequenciais nos cards, usar gradientes sutis nos backgrounds dos cards, adicionar call-to-actions mais evidentes em cada card. Manter a identidade visual única do site mas elevar o nível de sofisticação.","type":"feature","passes":true,"id":9},{"description":"Expandir e melhorar a HOME: Adicionar seção de DEPOIMENTOS de clientes (3-4 depoimentos fictícios mas realistas de empresas do setor de autopeças e varejo), seção de DIFERENCIAIS com 6 cards destacando vantagens competitivas (30 anos de experiência, suporte personalizado, tecnologia nacional, atualizações constantes, segurança de dados, custo-benefício), seção de PROCESSO com 4 etapas visuais mostrando como funciona a contratação (Consulta > Personalização > Implementação > Suporte), melhorar seção de estatísticas com animação de contadores, adicionar seção TECNOLOGIAS utilizadas (linguagens e frameworks), rodapé mais completo com redes sociais e mapa do site.","type":"feature","passes":true,"id":10},{"description":"Completar página TUTORIAIS com conteúdo real e útil: Criar categorias de tutoriais (Primeiros Passos, Configurações Avançadas, Emissão Fiscal, Relatórios, Dúvidas Frequentes), adicionar 8-12 cards de tutoriais fictícios mas realistas com títulos específicos para cada sistema (ex: 'Como emitir sua primeira NFe', 'Configurando impostos no SalesSpot', 'Cadastro de produtos no SalesMasters', etc), incluir filtros por sistema, barra de busca funcional, seção de vídeos em destaque do YouTube, área de downloads (manuais PDF, guias rápidos), seção FAQ expandida com 10-15 perguntas frequentes reais do setor.","type":"feature","passes":true,"id":11},{"description":"Aprimorar página CONTATO: Adicionar mapa integrado (pode ser iframe do Google Maps de Campo Grande/MS), informações de horário de atendimento, múltiplos canais de contato (WhatsApp com QR code, telefone, email, redes sociais), seção de FAQ rápido antes do formulário, melhorar formulário com validação visual, adicionar campo de assunto/sistema de interesse, mensagem de sucesso animada após envio, incluir endereço completo fictício em Campo Grande/MS.","type":"feature","passes":true,"id":12},{"description":"Melhorar TODAS as páginas: adicionar animações de scroll mais suaves e sofisticadas, implementar loading states elegantes, adicionar breadcrumbs de navegação nas páginas internas, melhorar responsividade para mobile com menu hamburger animado, adicionar botão de WhatsApp flutuante em todas as páginas (canto inferior direito), implementar smooth scroll entre seções, adicionar efeitos parallax em backgrounds onde apropriado, melhorar transições entre páginas.","type":"feature","passes":true,"id":13},{"description":"Criar seção SOBRE NÓS mais detalhada na Home: História da empresa (30 anos), missão e valores, equipe (pode ser genérico), localização em Campo Grande/MS, certificações e parcerias, compromisso com clientes, visão de futuro. Layout criativo com timeline dos 30 anos, fotos/ilustrações de equipe trabalhando, elementos visuais que mostrem a evolução da empresa.","type":"feature","passes":true,"id":14},{"description":"Criar páginas individuais para cada sistema com tutoriais específicos: /salesmaster (SalesMasters), /emissor-fiscal (Sistema Emissor), /salesspot (SalesSpot), /strudent-app (Strudent-App). Cada página deve ter: Hero com nome do sistema e descrição completa, seção de Recursos Principais com lista detalhada, seção de Tutoriais em Vídeo (grid de 9-12 vídeos do YouTube com thumbnails e títulos específicos - usar referência da imagem /home/user/Attachments/f40f8b72-8064-4124-945b-9fd323e68deb.png para estrutura), seção de Benefícios, galeria de screenshots/mockups do sistema, seção de Planos/Preços (3 opções), FAQ específico de cada sistema, CTA forte para contato/demonstração. Design único e impactante mantendo identidade visual.","type":"feature","passes":true,"id":15},{"description":"Atualizar os botões 'SAIBA MAIS' nos cards da página /sistemas para direcionar às páginas individuais de cada sistema: SalesMasters → /salesmaster, Sistema Emissor → /emissor-fiscal, SalesSpot → /salesspot, Strudent-App → /strudent-app. Remover link genérico para /contato.","type":"bug","passes":true,"id":16},{"description":"Na página de cada sistema, adicionar navegação secundária/abas para: Visão Geral, Tutoriais, Recursos, Preços, Suporte. Implementar scroll suave entre seções ou sistema de tabs interativo. Adicionar botão de Download de Manual em PDF para cada sistema.","type":"feature","passes":true,"id":17},{"description":"Implementar sistema completo de analytics com Google Analytics 4 (GA4). Criar componente Analytics que adiciona o script do GA4 no head de todas as páginas. Adicionar eventos de rastreamento para: todos os cliques em botões 'SAIBA MAIS' (com informação de qual sistema), cliques no botão WhatsApp flutuante, cliques em CTAs de contato, envio de formulários, cliques em links de sistemas, downloads de manuais PDF, cliques em vídeos de tutoriais, navegação entre abas nas páginas de sistemas. Usar dataLayer.push para enviar eventos customizados. Criar arquivo de configuração com ID de rastreamento (usar placeholder 'G-XXXXXXXXXX' que o usuário depois substitui pelo ID real do Google Analytics). Adicionar comentários explicativos no código sobre como obter e configurar o ID do GA4.","type":"feature","passes":true,"id":18,"passes":true},{"description":"Adicionar atributos data-* nos botões e links importantes para facilitar rastreamento: data-product-name, data-action-type, data-category. Criar função helper trackEvent() reutilizável que envia eventos para GA4 com categoria, ação, label e valor. Implementar tracking em: botões SAIBA MAIS (categoria: 'Sistemas', ação: 'click_saiba_mais', label: nome do sistema), botões de WhatsApp (categoria: 'Contato', ação: 'click_whatsapp', label: página atual), formulário de contato (categoria: 'Lead', ação: 'submit_form', label: tipo de interesse), downloads PDF (categoria: 'Download', ação: 'download_manual', label: nome do sistema).","type":"feature","passes":true,"id":19},{"description":"Criar dashboard de analytics visual no próprio site (página /analytics protegida por senha simples) que mostra estatísticas básicas em tempo real: total de cliques por sistema, CTAs mais clicados, páginas mais visitadas, taxa de conversão do formulário. Usar localStorage para armazenar dados localmente e exibir. Adicionar botão de exportar dados em CSV. Design minimalista com gráficos simples usando CSS puro (sem bibliotecas externas). Incluir instruções de como conectar com Google Analytics real.","type":"feature","passes":true,"id":20}]